# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [32, 3]],  # 0-P1/2
   [-1, 1, BottleneckMV2, [32, False, 32, 1.0, 1.0]], # 1
   [1, 1, Conv, [16, 3, 1, None, 16]], # 2
   [[1, 2], 1, Concat, [1]], # 3
   [-1, 1, Conv, [48, 1, 1]], # 4
   [-1, 1, TransitionMV2, [24]], # 5-P2/4
   [-1, 1, BottleneckMV2, [24]], # 6
   [4, 1, Conv, [48, 3, 2, None, 48]], # 7
   [[6, 7], 1, Concat, [1]], # 8
   [-1, 1, Conv, [72, 1, 1]], # 9
   [-1, 1, TransitionMV2, [32]], # 10-P3/8
   [-1, 2, BottleneckMV2, [32]], # 11
   [-1, 1, BottleneckMV2, [64]], # 12
   [-1, 3, BottleneckMV2, [64]], # 13
   [9, 1, Conv, [72, 3, 2, None, 72]], # 14
   [[13, 14], 1, Concat, [1]], # 15
   [-1, 1, Conv, [192, 1, 1]], # 16
   [-1, 1, TransitionMV2, [96]], # 17-P4/16
   [-1, 2, BottleneckMV2, [96]], # 18
   [16, 1, Conv, [192, 3, 2, None, 192]], # 19
   [[18, 19], 1, Concat, [1]], # 20
   [-1, 1, Conv, [288, 1, 1]], # 21
   [-1, 1, TransitionMV2, [160]], # 22-P5/32
   [-1, 2, BottleneckMV2, [160]], # 23
   [-1, 1, BottleneckMV2, [320]], # 24
   [21, 1, Conv, [288, 3, 2, None, 288]], # 25
   [[24, 25], 1, Concat, [1]], # 26
   [-1, 1, Conv, [640, 1, 1]], # 27
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [288, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 21], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, BottleneckCSP, [288, False]],  # 31

   [-1, 1, Conv, [192, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 16], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, BottleneckCSP, [192, False]],  # 35 (P3/8-small)

   [-1, 1, Conv, [192, 3, 2]],
   [[-1, 32], 1, Concat, [1]],  # cat head P4
   [-1, 1, BottleneckCSP, [288, False]],  # 38 (P4/16-medium)

   [-1, 1, Conv, [288, 3, 2]],
   [[-1, 28], 1, Concat, [1]],  # cat head P5
   [-1, 1, BottleneckCSP, [512, False]],  # 41 (P5/32-large)

   [[35, 38, 41], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
